app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new post"], ["body", "new posttt"], ["user_id", 3], ["created_at", "2021-04-20 11:38:42.475250"], ["updated_at", "2021-04-20 11:38:42.475250"]]